export type Unit = {
    id: number;
    text: string;
    value: string;
}

export type Division = {
    id: number;
    text: string;
    value: string;
}

const unitData: Unit[] = [
    {
        id: 1,
        text: "งานหน่วยตรวจสอบภายใน",
        value: "งานหน่วยตรวจสอบภายใน"
    },
    {
        id: 2,
        text: "ฝ่ายบริหารโรงพยาบาล",
        value: "ฝ่ายบริหารโรงพยาบาล"
    },
    {
        id: 3,
        text: "งานพัฒนาคุณภาพบริการ",
        value: "งานพัฒนาคุณภาพบริการ"
    },
    {
        id: 4,
        text: "งานสารสนเทศ",
        value: "งานสารสนเทศ"
    },
    {
        id: 5,
        text: "งานบริหารทรัพยากรมนุษย์",
        value: "งานบริหารทรัพยากรมนุษย์"
    },
    {
        id: 6,
        text: "งานสารบรรณและธุรการ",
        value: "งานสารบรรณและธุรการ"
    },
    {
        id: 7,
        text: "งานสื่อสารองค์กรและลูกค้าสัมพันธ์",
        value: "งานสื่อสารองค์กรและลูกค้าสัมพันธ์"
    },
    {
        id: 8,
        text: "งานอาคารสถานที่",
        value: "งานอาคารสถานที่"
    },
    {
        id: 9,
        text: "หน่วยพัฒนาทรัพยากรมนุษย์",
        value: "หน่วยพัฒนาทรัพยากรมนุษย์"
    },
    {
        id: 10,
        text: "ศูนย์วิศวกรรมและการจัดการสิ่งอำนวยความสะดวก",
        value: "ศูนย์วิศวกรรมและการจัดการสิ่งอำนวยความสะดวก"
    },
    {
        id: 11,
        text: "ฝ่ายบริหารแผนและการคลัง",
        value: "ฝ่ายบริหารแผนและการคลัง"
    },
    {
        id: 12,
        text: "งานการเงิน",
        value: "งานการเงิน"
    },
    {
        id: 13,
        text: "งานบัญชี",
        value: "งานบัญชี"
    },
    {
        id: 14,
        text: "งานรายได้",
        value: "งานรายได้"
    },
    {
        id: 15,
        text: "งานจัดหาพัสดุ",
        value: "งานจัดหาพัสดุ"
    },
    {
        id: 16,
        text: "งานทะเบียนและคลังพัสดุ",
        value: "งานทะเบียนและคลังพัสดุ"
    },
    {
        id: 17,
        text: "งานนโยบายและแผน",
        value: "งานนโยบายและแผน"
    },
    {
        id: 18,
        text: "หน่วยรับบริจาค",
        value: "หน่วยรับบริจาค"
    },
    {
        id: 19,
        text: "งานจัดส่งกลาง",
        value: "งานจัดส่งกลาง"
    },
    {
        id: 20,
        text: "ฝ่ายสนับสนุนบริการ",
        value: "ฝ่ายสนับสนุนบริการ"
    },
    {
        id: 21,
        text: "งานเวชสารสนเทศ",
        value: "งานเวชสารสนเทศ"
    },
    {
        id: 22,
        text: "งานบริการเปลและยานพาหนะ",
        value: "งานบริการเปลและยานพาหนะ"
    },
    {
        id: 23,
        text: "งานประกันสุขภาพ",
        value: "งานประกันสุขภาพ"
    },
    {
        id: 24,
        text: "งานสังคมสงเคราะห์",
        value: "งานสังคมสงเคราะห์"
    },
    {
        id: 25,
        text: "งานโภชนาการ",
        value: "งานโภชนาการ"
    },
    {
        id: 26,
        text: "งานจ่ายกลาง",
        value: "งานจ่ายกลาง"
    },
    {
        id: 27,
        text: "งานบริการผ้า",
        value: "งานบริการผ้า"
    },
    {
        id: 28,
        text: "หน่วยประสานสิทธิการรักษาพยาบาล",
        value: "หน่วยประสานสิทธิการรักษาพยาบาล"
    },
    {
        id: 29,
        text: "ฝ่ายการแพทย์",
        value: "ฝ่ายการแพทย์"
    },
    {
        id: 30,
        text: "สาขาศัลยกรรม",
        value: "สาขาศัลยกรรม"
    },
    {
        id: 31,
        text: "สาขากุมารเวชกรรม",
        value: "สาขากุมารเวชกรรม"
    },
    {
        id: 32,
        text: "สาขาสูติ-นรีเวชกรรม",
        value: "สาขาสูติ-นรีเวชกรรม"
    },
    {
        id: 33,
        text: "สาขาอายุรกรรม",
        value: "สาขาอายุรกรรม"
    },
    {
        id: 34,
        text: "สาขารังสี",
        value: "สาขารังสี"
    },
    {
        id: 35,
        text: "สาขาจักษุ",
        value: "สาขาจักษุ"
    },
    {
        id: 36,
        text: "สาขาเวชกรรมฟื้นฟู",
        value: "สาขาเวชกรรมฟื้นฟู"
    },
    {
        id: 37,
        text: "สาขาศัลยกรรมกระดูกและข้อ",
        value: "สาขาศัลยกรรมกระดูกและข้อ"
    },
    {
        id: 38,
        text: "สาขา หู คอ จมูก",
        value: "สาขา หู คอ จมูก"
    },
    {
        id: 39,
        text: "สาขาพยาธิ",
        value: "สาขาพยาธิ"
    },
    {
        id: 40,
        text: "สาขานิติเวช",
        value: "สาขานิติเวช"
    },
    {
        id: 41,
        text: "สาขาวิสัญญี",
        value: "สาขาวิสัญญี"
    },
    {
        id: 42,
        text: "สาขาจิตเวช",
        value: "สาขาจิตเวช"
    },
    {
        id: 43,
        text: "สาขาเวชกรรมฉุกเฉิน",
        value: "สาขาเวชกรรมฉุกเฉิน"
    },
    {
        id: 44,
        text: "สาขาเวชศาสตร์ทั่วไป/ครอบครัว",
        value: "สาขาเวชศาสตร์ทั่วไป/ครอบครัว"
    },
    {
        id: 45,
        text: "ศูนย์นวัตกรรมสุขภาพ ธรรมศาสตร์",
        value: "ศูนย์นวัตกรรมสุขภาพ ธรรมศาสตร์"
    },
    {
        id: 46,
        text: "หน่วยวิจัยและนวัตกรรม",
        value: "หน่วยวิจัยและนวัตกรรม"
    },
    {
        id: 47,
        text: "งานตรวจวินิจฉัยทางการแพทย์",
        value: "งานตรวจวินิจฉัยทางการแพทย์"
    },
    {
        id: 48,
        text: "ศูนย์ความเป็นเลิศทางการแพทย์",
        value: "ศูนย์ความเป็นเลิศทางการแพทย์"
    },
    {
        id: 49,
        text: "ศูนย์ทรานส์ฟอร์เมชั่น",
        value: "ศูนย์ทรานส์ฟอร์เมชั่น"
    },
    {
        id: 50,
        text: "ศูนย์พันธุศาสตร์ทางการแพทย์ /หน่วย Medical Genomics",
        value: "ศูนย์พันธุศาสตร์ทางการแพทย์ /หน่วย Medical Genomics"
    },
    {
        id: 51,
        text: "ศูนย์ธรรมศาสตร์ ธรรมรักษ์",
        value: "ศูนย์ธรรมศาสตร์ ธรรมรักษ์"
    },
    {
        id: 52,
        text: "งานการพยาบาลธรรมศาสตร์ธรรมรักษ์",
        value: "งานการพยาบาลธรรมศาสตร์ธรรมรักษ์"
    },
    {
        id: 53,
        text: "หน่วยดูแลประคับประคอง",
        value: "หน่วยดูแลประคับประคอง"
    },
    {
        id: 54,
        text: "งานบริหารทั่วไป",
        value: "งานบริหารทั่วไป"
    },
    {
        id: 55,
        text: "หน่วยเวชศาสตร์ผู้สูงอายุธรรมศาสตร์ ธรรมรักษ์",
        value: "หน่วยเวชศาสตร์ผู้สูงอายุธรรมศาสตร์ ธรรมรักษ์"
    },
    {
        id: 56,
        text: "ฝ่ายการพยาบาล",
        value: "ฝ่ายการพยาบาล"
    },
    {
        id: 57,
        text: "งานการพยาบาลตรวจโรคอายุรกรรม 1",
        value: "งานการพยาบาลตรวจโรคอายุรกรรม 1"
    },
    {
        id: 58,
        text: "งานการพยาบาลตรวจโรคอายุรกรรม 2",
        value: "งานการพยาบาลตรวจโรคอายุรกรรม 2"
    },
    {
        id: 59,
        text: "งานการพยาบาลตรวจโรคกุมารเวชกรรม",
        value: "งานการพยาบาลตรวจโรคกุมารเวชกรรม"
    },
    {
        id: 60,
        text: "งานการพยาบาลตรวจโรคเวชศาสตร์ทั่วไปและครอบครัว",
        value: "งานการพยาบาลตรวจโรคเวชศาสตร์ทั่วไปและครอบครัว"
    },
    {
        id: 61,
        text: "หน่วยประสานบริการผู้ป่วยมะเร็ง",
        value: "หน่วยประสานบริการผู้ป่วยมะเร็ง"
    },
    {
        id: 62,
        text: "งานการพยาบาลตรวจโรคติดเชื้อแพร่กระจายทางอากาศ",
        value: "งานการพยาบาลตรวจโรคติดเชื้อแพร่กระจายทางอากาศ"
    },
    {
        id: 63,
        text: "งานการพยาบาลสุขภาพจิต",
        value: "งานการพยาบาลสุขภาพจิต"
    },
    {
        id: 64,
        text: "หน่วยการพยาบาลผู้ป่วยเบาหวาน",
        value: "หน่วยการพยาบาลผู้ป่วยเบาหวาน"
    },
    {
        id: 65,
        text: "หน่วยการพยาบาลรวมใจรักษ์",
        value: "หน่วยการพยาบาลรวมใจรักษ์"
    },
    {
        id: 66,
        text: "หน่วยการพยาบาลตรวจโรคภูมิแพ้ โรคหืดและโรคระบบหายใจ",
        value: "หน่วยการพยาบาลตรวจโรคภูมิแพ้ โรคหืดและโรคระบบหายใจ"
    },
    {
        id: 67,
        text: "Thammasat Lifestyle and Wellness Medical Center งานการพยาบาลสุขภาพเชิงป้องกันและบูรณาการสมดุลชีวิต",
        value: "Thammasat Lifestyle and Wellness Medical Center งานการพยาบาลสุขภาพเชิงป้องกันและบูรณาการสมดุลชีวิต"
    },
    {
        id: 68,
        text: "งานการพยาบาลตรวจโรคศัลยกรรม 1",
        value: "งานการพยาบาลตรวจโรคศัลยกรรม 1"
    },
    {
        id: 69,
        text: "งานการพยาบาลตรวจโรคศัลยกรรม 2",
        value: "งานการพยาบาลตรวจโรคศัลยกรรม 2"
    },
    {
        id: 70,
        text: "งานการพยาบาลผู้ป่วยโรคไตและไตเทียม",
        value: "งานการพยาบาลผู้ป่วยโรคไตและไตเทียม"
    },
    {
        id: 71,
        text: "หน่วยการพยาบาลไตเทียมประสิทธิภาพสูง",
        value: "หน่วยการพยาบาลไตเทียมประสิทธิภาพสูง"
    },
    {
        id: 72,
        text: "งานการพยาบาลตรวจโรคหู คอ จมูก",
        value: "งานการพยาบาลตรวจโรคหู คอ จมูก"
    },
    {
        id: 73,
        text: "งานการพยาบาลตรวจโรคศัลยกรรมกระดูกและข้อ / เวชศาสตร์ฟื้นฟู",
        value: "งานการพยาบาลตรวจโรคศัลยกรรมกระดูกและข้อ / เวชศาสตร์ฟื้นฟู"
    },
    {
        id: 74,
        text: "งานการพยาบาลตรวจโรคจักษุ",
        value: "งานการพยาบาลตรวจโรคจักษุ"
    },
    {
        id: 75,
        text: "งานการพยาบาลตรวจโรคสูตินรีเวชกรรม",
        value: "งานการพยาบาลตรวจโรคสูตินรีเวชกรรม"
    },
    {
        id: 76,
        text: "งานการพยาบาลผู้ป่วยโรคหัวใจและหลอดเลือด",
        value: "งานการพยาบาลผู้ป่วยโรคหัวใจและหลอดเลือด"
    },
    {
        id: 77,
        text: "หน่วยการพยาบาลตรวจโรคผิวหนัง",
        value: "หน่วยการพยาบาลตรวจโรคผิวหนัง"
    },
    {
        id: 78,
        text: "หน่วยการพยาบาลตรวจโรคเวชศาสตร์ฟื้นฟู",
        value: "หน่วยการพยาบาลตรวจโรคเวชศาสตร์ฟื้นฟู"
    },
    {
        id: 79,
        text: "งานการพยาบาลผู้ป่วยผ่าตัด",
        value: "งานการพยาบาลผู้ป่วยผ่าตัด"
    },
    {
        id: 80,
        text: "งานการพยาบาลผู้ป่วยวิสัญญี",
        value: "งานการพยาบาลผู้ป่วยวิสัญญี"
    },
    {
        id: 81,
        text: "งานการพยาบาลผู้ป่วยก่อนและหลังผ่าตัด",
        value: "งานการพยาบาลผู้ป่วยก่อนและหลังผ่าตัด"
    },
    {
        id: 82,
        text: "งานการพยาบาลผู้ป่วยส่องกล้องและหัตถการพิเศษ",
        value: "งานการพยาบาลผู้ป่วยส่องกล้องและหัตถการพิเศษ"
    },
    {
        id: 83,
        text: "งานงานการพยาบาลผู้ป่วยผ่าตัดไม่ค้างคืน",
        value: "งานงานการพยาบาลผู้ป่วยผ่าตัดไม่ค้างคืน"
    },
    {
        id: 84,
        text: "งานการพยาบาลผู้คลอด",
        value: "งานการพยาบาลผู้คลอด"
    },
    {
        id: 85,
        text: "งานการพยาบาลผู้ป่วยสูติ-นรีเวชกรรมสามัญ",
        value: "งานการพยาบาลผู้ป่วยสูติ-นรีเวชกรรมสามัญ"
    },
    {
        id: 86,
        text: "งานการพยาบาลผู้ป่วยสูติ-นรีเวชกรรมพิเศษ",
        value: "งานการพยาบาลผู้ป่วยสูติ-นรีเวชกรรมพิเศษ"
    },
    {
        id: 87,
        text: "งานการพยาบาลเวชศาสตร์การเจริญพันธ์",
        value: "งานการพยาบาลเวชศาสตร์การเจริญพันธ์"
    },
    {
        id: 88,
        text: "หน่วยการพยาบาลอิตถีบูรณา",
        value: "หน่วยการพยาบาลอิตถีบูรณา"
    },
    {
        id: 89,
        text: "งานการพยาบาลเวชศาสตร์มารดาและทารกในครรภ์",
        value: "งานการพยาบาลเวชศาสตร์มารดาและทารกในครรภ์"
    },
    {
        id: 90,
        text: "หน่วยการพยาบาลมะเร็งนรีเวช",
        value: "หน่วยการพยาบาลมะเร็งนรีเวช"
    },
    {
        id: 91,
        text: "งานการพยาบาลคัดกรองและรับผู้ป่วยใน",
        value: "งานการพยาบาลคัดกรองและรับผู้ป่วยใน"
    },
    {
        id: 92,
        text: "งานอุบัติเหตุและฉุกเฉิน",
        value: "งานอุบัติเหตุและฉุกเฉิน"
    },
    {
        id: 93,
        text: "งานการพยาบาลรังสีวิทยา",
        value: "งานการพยาบาลรังสีวิทยา"
    },
    {
        id: 94,
        text: "หน่วยบริการการแพทย์ฉุกเฉินและปฏิบัติการส่งต่อผู้ป่วยระหว่างสถานพยาบาล",
        value: "หน่วยบริการการแพทย์ฉุกเฉินและปฏิบัติการส่งต่อผู้ป่วยระหว่างสถานพยาบาล"
    },
    {
        id: 95,
        text: "งานการพยาบาลผู้ป่วยต่อเนื่อง",
        value: "งานการพยาบาลผู้ป่วยต่อเนื่อง"
    },
    {
        id: 96,
        text: "งานการพยาบาลหัตถการและตรวจโรคนอกเวลาราชการ",
        value: "งานการพยาบาลหัตถการและตรวจโรคนอกเวลาราชการ"
    },
    {
        id: 97,
        text: "งานการพยาบาลผู้ป่วยอายุรกรรมชายพิเศษ",
        value: "งานการพยาบาลผู้ป่วยอายุรกรรมชายพิเศษ"
    },
    {
        id: 98,
        text: "งานการพยาบาลผู้ป่วยอายุรกรรมชายสามัญ",
        value: "งานการพยาบาลผู้ป่วยอายุรกรรมชายสามัญ"
    },
    {
        id: 99,
        text: "งานการพยาบาลผู้ป่วยอายุรกรรมหญิงพิเศษ",
        value: "งานการพยาบาลผู้ป่วยอายุรกรรมหญิงพิเศษ"
    },
    {
        id: 100,
        text: "งานการพยาบาลผู้ป่วยอายุรกรรมหญิงสามัญ",
        value: "งานการพยาบาลผู้ป่วยอายุรกรรมหญิงสามัญ"
    },
    {
        id: 101,
        text: "งานการพยาบาลผู้ป่วยโรคหลอดเลือดสมองและระบบประสาท",
        value: "งานการพยาบาลผู้ป่วยโรคหลอดเลือดสมองและระบบประสาท"
    },
    {
        id: 102,
        text: "งานการพยาบาลผู้ป่วยปัญจา",
        value: "งานการพยาบาลผู้ป่วยปัญจา"
    },
    {
        id: 103,
        text: "งานการพยาบาลผู้ป่วยอายุรกรรมความดันลบ",
        value: "งานการพยาบาลผู้ป่วยอายุรกรรมความดันลบ"
    },
    {
        id: 104,
        text: "งานการพยาบาลผู้ป่วยเคมีบำบัดและศูนย์ปลูกถ่ายเซลล์ต้นกำเนิดเม็ดเลือด",
        value: "งานการพยาบาลผู้ป่วยเคมีบำบัดและศูนย์ปลูกถ่ายเซลล์ต้นกำเนิดเม็ดเลือด"
    },
    {
        id: 105,
        text: "งานการพยาบาลผู้ป่วยอายุรกรรมกิตติวัฒนา",
        value: "งานการพยาบาลผู้ป่วยอายุรกรรมกิตติวัฒนา"
    },
    {
        id: 106,
        text: "งานการพยาบาลผู้ป่วยนอกเคมีบำบัดและหอผู้ป่วยพิเศษเคมีบำบัด",
        value: "งานการพยาบาลผู้ป่วยนอกเคมีบำบัดและหอผู้ป่วยพิเศษเคมีบำบัด"
    },
    {
        id: 107,
        text: "งานการพยาบาลผู้ป่วยกุมารเวชกรรมพิเศษ",
        value: "งานการพยาบาลผู้ป่วยกุมารเวชกรรมพิเศษ"
    },
    {
        id: 108,
        text: "งานการพยาบาลผู้ป่วยกุมารเวชกรรม 1",
        value: "งานการพยาบาลผู้ป่วยกุมารเวชกรรม 1"
    },
    {
        id: 109,
        text: "งานการพยาบาลผู้ป่วยกุมารเวชกรรม 2",
        value: "งานการพยาบาลผู้ป่วยกุมารเวชกรรม 2"
    },
    {
        id: 110,
        text: "งานการพยาบาลผู้ป่วยวิกฤตกุมารเวชกรรม",
        value: "งานการพยาบาลผู้ป่วยวิกฤตกุมารเวชกรรม"
    },
    {
        id: 111,
        text: "งานการพยาบาลผู้ป่วยกึ่งวิกฤตทารกแรกเกิด",
        value: "งานการพยาบาลผู้ป่วยกึ่งวิกฤตทารกแรกเกิด"
    },
    {
        id: 112,
        text: "งานการพยาบาลผู้ป่วยวิกฤตทารกแรกเกิด",
        value: "งานการพยาบาลผู้ป่วยวิกฤตทารกแรกเกิด"
    },
    {
        id: 113,
        text: "งานการพยาบาลผู้ป่วยศัลยกรรม 1",
        value: "งานการพยาบาลผู้ป่วยศัลยกรรม 1"
    },
    {
        id: 114,
        text: "งานการพยาบาลผู้ป่วยศัลยกรรม 2",
        value: "งานการพยาบาลผู้ป่วยศัลยกรรม 2"
    },
    {
        id: 115,
        text: "งานการพยาบาลผู้ป่วยศัลยกรรม 3",
        value: "งานการพยาบาลผู้ป่วยศัลยกรรม 3"
    },
    {
        id: 116,
        text: "งานการพยาบาลผู้ป่วยศัลยกรรมพิเศษ 1",
        value: "งานการพยาบาลผู้ป่วยศัลยกรรมพิเศษ 1"
    },
    {
        id: 117,
        text: "งานการพยาบาลผู้ป่วยศัลยกรรมพิเศษ 2",
        value: "งานการพยาบาลผู้ป่วยศัลยกรรมพิเศษ 2"
    },
    {
        id: 118,
        text: "งานการพยาบาลผู้ป่วยศัลยกรรมอุบัติเหตุ",
        value: "งานการพยาบาลผู้ป่วยศัลยกรรมอุบัติเหตุ"
    },
    {
        id: 119,
        text: "งานการพยาบาลผู้ป่วยพิเศษยูงทอง1",
        value: "งานการพยาบาลผู้ป่วยพิเศษยูงทอง1"
    },
    {
        id: 120,
        text: "งานการพยาบาลผู้ป่วยพิเศษยูงทอง 2",
        value: "งานการพยาบาลผู้ป่วยพิเศษยูงทอง 2"
    },
    {
        id: 121,
        text: "งานการพยาบาลผู้ป่วยพิเศษยูงทอง 3",
        value: "งานการพยาบาลผู้ป่วยพิเศษยูงทอง 3"
    },
    {
        id: 122,
        text: "งานการพยาบาลผู้ป่วยพิเศษยูงทอง 4",
        value: "งานการพยาบาลผู้ป่วยพิเศษยูงทอง 4"
    },
    {
        id: 123,
        text: "งานการพยาบาลผู้ป่วยพิเศษยูงทอง 5",
        value: "งานการพยาบาลผู้ป่วยพิเศษยูงทอง 5"
    },
    {
        id: 124,
        text: "งานการพยาบาลผู้ป่วยพิเศษยูงทอง 6",
        value: "งานการพยาบาลผู้ป่วยพิเศษยูงทอง 6"
    },
    {
        id: 125,
        text: "งานการพยาบาลผู้ป่วยพิเศษดุลโสภาคย์ 4",
        value: "งานการพยาบาลผู้ป่วยพิเศษดุลโสภาคย์ 4"
    },
    {
        id: 126,
        text: "งานการพยาบาลผู้ป่วยพิเศษดุลโสภาคย์ 5",
        value: "งานการพยาบาลผู้ป่วยพิเศษดุลโสภาคย์ 5"
    },
    {
        id: 127,
        text: "งานการพยาบาลผู้ป่วยวิกฤตศัลยกรรม",
        value: "งานการพยาบาลผู้ป่วยวิกฤตศัลยกรรม"
    },
    {
        id: 128,
        text: "งานการพยาบาลผู้ป่วยวิกฤตศัลยกรรมหัวใจและทรวงอก",
        value: "งานการพยาบาลผู้ป่วยวิกฤตศัลยกรรมหัวใจและทรวงอก"
    },
    {
        id: 129,
        text: "งานการพยาบาลผู้ป่วยวิกฤตโรคหัวใจ",
        value: "งานการพยาบาลผู้ป่วยวิกฤตโรคหัวใจ"
    },
    {
        id: 130,
        text: "งานการพยาบาลผู้ป่วยวิกฤตศัลยกรรมระบบประสาท",
        value: "งานการพยาบาลผู้ป่วยวิกฤตศัลยกรรมระบบประสาท"
    },
    {
        id: 131,
        text: "งานการพยาบาลผู้ป่วยวิกฤตอายุรกรรม",
        value: "งานการพยาบาลผู้ป่วยวิกฤตอายุรกรรม"
    },
    {
        id: 132,
        text: "งานการพยาบาลผู้ป่วยวิกฤตวิสัญญี",
        value: "งานการพยาบาลผู้ป่วยวิกฤตวิสัญญี"
    },
    {
        id: 133,
        text: "งานการพยาบาลผู้ป่วยวิกฤตระบบการหายใจ",
        value: "งานการพยาบาลผู้ป่วยวิกฤตระบบการหายใจ"
    },
    {
        id: 134,
        text: "งานการพยาบาลผู้ป่วยวิกฤตไฟไหม้น้ำร้อนลวก",
        value: "งานการพยาบาลผู้ป่วยวิกฤตไฟไหม้น้ำร้อนลวก"
    },
    {
        id: 135,
        text: "งานการพยาบาลผู้ป่วยวิกฤตศัลยกรรมอุบัติเหตุ",
        value: "งานการพยาบาลผู้ป่วยวิกฤตศัลยกรรมอุบัติเหตุ"
    },
    {
        id: 136,
        text: "งานการพยาบาลผู้ป่วยศัลยกรรมระบบประสาท",
        value: "งานการพยาบาลผู้ป่วยศัลยกรรมระบบประสาท"
    },
    {
        id: 137,
        text: "งานการพยาบาลผู้ป่วยจักษุ",
        value: "งานการพยาบาลผู้ป่วยจักษุ"
    },
    {
        id: 138,
        text: "งานการพยาบาลผู้ป่วยศัลยกรรมกระดูกและข้อพิเศษ",
        value: "งานการพยาบาลผู้ป่วยศัลยกรรมกระดูกและข้อพิเศษ"
    },
    {
        id: 139,
        text: "งานการพยาบาลผู้ป่วยศัลยกรรมกระดูกและข้อสามัญและเวชศาสตร์ฟื้นฟู",
        value: "งานการพยาบาลผู้ป่วยศัลยกรรมกระดูกและข้อสามัญและเวชศาสตร์ฟื้นฟู"
    },
    {
        id: 140,
        text: "งานควบคุมโรคติดเชื้อ",
        value: "งานควบคุมโรคติดเชื้อ"
    },
    {
        id: 141,
        text: "งานการพยาบาลผู้ป่วยหู คอ จมูก ทันตกรรม และศัลยกรรมช่องปาก",
        value: "งานการพยาบาลผู้ป่วยหู คอ จมูก ทันตกรรม และศัลยกรรมช่องปาก"
    },
    {
        id: 142,
        text: "ฝ่ายทันตกรรม",
        value: "ฝ่ายทันตกรรม"
    },
    {
        id: 143,
        text: "งานวิจัย และนวัตกรรมทางทันตกรรม",
        value: "งานวิจัย และนวัตกรรมทางทันตกรรม"
    },
    {
        id: 144,
        text: "งานบริการทางทันตกรรม",
        value: "งานบริการทางทันตกรรม"
    },
    {
        id: 145,
        text: "งานบริหารทางทันตกรรม",
        value: "งานบริหารทางทันตกรรม"
    },
    {
        id: 146,
        text: "ฝ่ายสหเวชศาสตร์",
        value: "ฝ่ายสหเวชศาสตร์"
    },
    {
        id: 147,
        text: "งานห้องปฏิบัติการเทคนิคการแพทย์",
        value: "งานห้องปฏิบัติการเทคนิคการแพทย์"
    },
    {
        id: 148,
        text: "งานกายภาพบำบัด",
        value: "งานกายภาพบำบัด"
    },
    {
        id: 149,
        text: "งานธนาคารเลือด",
        value: "งานธนาคารเลือด"
    },
    {
        id: 150,
        text: "หน่วยจุลชีววิทยา",
        value: "หน่วยจุลชีววิทยา"
    },
    {
        id: 151,
        text: "งานส่งเสริมสุขภาพ",
        value: "งานส่งเสริมสุขภาพ"
    },
    {
        id: 152,
        text: "งานรังสีวิทยา",
        value: "งานรังสีวิทยา"
    },
    {
        id: 153,
        text: "งานเครื่องมือแพทย์",
        value: "งานเครื่องมือแพทย์"
    },
    {
        id: 154,
        text: "หน่วยอาชีวอนามัยและศูนย์บริการสุขภาพ",
        value: "หน่วยอาชีวอนามัยและศูนย์บริการสุขภาพ"
    },
    {
        id: 155,
        text: "หน่วยรังสีรักษาและมะเร็งวิทยา",
        value: "หน่วยรังสีรักษาและมะเร็งวิทยา"
    },
    {
        id: 156,
        text: "ฝ่ายเภสัชกรรม",
        value: "ฝ่ายเภสัชกรรม"
    },
    {
        id: 157,
        text: "งานจัดซื้อยา",
        value: "งานจัดซื้อยา"
    },
    {
        id: 158,
        text: "งานบริบาลเภสัชกรรม",
        value: "งานบริบาลเภสัชกรรม"
    },
    {
        id: 159,
        text: "งานคลังยา",
        value: "งานคลังยา"
    },
    {
        id: 160,
        text: "งานผลิตยา",
        value: "งานผลิตยา"
    },
    {
        id: 161,
        text: "งานเภสัชกรรมผู้ป่วยใน",
        value: "งานเภสัชกรรมผู้ป่วยใน"
    },
    {
        id: 162,
        text: "งานเภสัชกรรมผู้ป่วยนอก",
        value: "งานเภสัชกรรมผู้ป่วยนอก"
    },
    {
        id: 163,
        text: "งานเคมีบำบัด",
        value: "งานเคมีบำบัด"
    },
]

export default unitData;

export const divisionData: Division[] = [
    {
        id: 1,
        text: "โรงพยาบาลธรรมศาสตร์เฉลิมพระเกียรติ",
        value: "โรงพยาบาลธรรมศาสตร์เฉลิมพระเกียรติ"
    },
    {
        id: 2,
        text: "ฝ่ายบริหารโรงพยาบาล",
        value: "ฝ่ายบริหารโรงพยาบาล"
    },
    {
        id: 3,
        text: "ฝ่ายบริหารแผนและการคลัง",
        value: "ฝ่ายบริหารแผนและการคลัง"
    },
    {
        id: 4,
        text: "ฝ่ายสนับสนุนบริการ",
        value: "ฝ่ายสนับสนุนบริการ"
    },
    {
        id: 5,
        text: "ฝ่ายการแพทย์",
        value: "ฝ่ายการแพทย์"
    },
    {
        id: 6,
        text: "ศูนย์นวัตกรรมสุขภาพ ธรรมศาสตร์",
        value: "ศูนย์นวัตกรรมสุขภาพ ธรรมศาสตร์"
    },
    {
        id: 7,
        text: "ศูนย์ธรรมศาสตร์ ธรรมรักษ์",
        value: "ศูนย์ธรรมศาสตร์ ธรรมรักษ์"
    },
    {
        id: 8,
        text: "ฝ่ายการพยาบาล",
        value: "ฝ่ายการพยาบาล"
    },
    {
        id: 9,
        text: "ฝ่ายทันตกรรม",
        value: "ฝ่ายทันตกรรม"
    },
    {
        id: 10,
        text: "ฝ่ายสหเวชศาสตร์",
        value: "ฝ่ายสหเวชศาสตร์"
    },
    {
        id: 11,
        text: "ฝ่ายเภสัชกรรม",
        value: "ฝ่ายเภสัชกรรม"
    },
]
