export type MentalAssessment = {
    id: number;
    question: string;
    type: string;
}

export const mentalAssessment: MentalAssessment[] = [
    { id: 1, question: "ฉันรู้สึกยากที่จะสงบจิตใจลง", type: "stress" },
    { id: 2, question: "ฉันรู้สึกปากแห้งคอแห้ง", type: "anxiety" },
    { id: 3, question: "ฉันแทบไม่รู้สึกอะไรดี ๆ เลย", type: "depress" },
    { id: 4, question: "ฉันมีอาการหายใจผิดปกติ (เช่น หายใจเร็วเกินเหตุ มีอาการหายใจไม่ทันแม้ว่าไม่ได้ออกแรง)", type: "anxiety" },
    { id: 5, question: "ฉันพบว่ามันยากที่จะคิดริเริ่มทำสิ่งใดสิ่งหนึ่ง", type: "depress" },
    { id: 6, question: "ฉันมีปฏิกิริยาตอบสนองต่อสิ่งต่าง ๆ รุนแรงเกินเหตุ", type: "stress" },
    { id: 7, question: "ฉันรู้สึกว่าร่างกายบางส่วนสั่นผิดปกติ (เช่น มือสั่น)", type: "anxiety" },
    { id: 8, question: "ฉันใช้พลังไปมากกับการวิตกกังวล", type: "stress" },
    { id: 9, question: "ฉันรู้สึกกังวลกับเหตุการณ์ที่อาจทำให้ฉันรู้สึกตื่นกลัว และกระทำบางสิ่งที่น่าอับอาย", type: "anxiety" },
    { id: 10, question: "ฉันรู้สึกไม่มีเป้าหมายในชีวิต", type: "depress" },
    { id: 11, question: "ฉันรู้สึกกระวนกระวายใจ", type: "stress" },
    { id: 12, question: "ฉันรู้สึกยากที่จะผ่อนคลาย", type: "stress" },
    { id: 13, question: "ฉันรู้สึกจิตใจเหงาหงอยเศร้าซึม", type: "depress" },
    { id: 14, question: "ฉันรู้สึกทนไม่ได้เวลามีอะไรมาขัดขวางสิ่งที่ฉันกำลังทำอยู่", type: "stress" },
    { id: 15, question: "ฉันรู้สึกคล้ายจะมีอาการหวั่นวิตก", type: "anxiety" },
    { id: 16, question: "ฉันรู้สึกไม่มีความกระตือรือร้นต่อสิ่งใด", type: "depress" },
    { id: 17, question: "ฉันรู้สึกเป็นคนไม่มีคุณค่า", type: "depress" },
    { id: 18, question: "ฉันรู้สึกค่อนข้างฉุนเฉียวง่าย", type: "stress" },
    { id: 19, question: "ฉันรับรู้ถึงการทำงานของหัวใจแม้ในตอนที่ฉันไม่ได้ออกแรง (เช่น รู้สึกว่าหัวใจเต้นเร็วขึ้น หรือเต้นไม่เป็นจังหวะ)", type: "anxiety" },
    { id: 20, question: "ฉันรู้สึกกลัวโดยไม่มีเหตุผล", type: "anxiety" },
    { id: 21, question: "ฉันรู้สึกว่าชีวิตไม่มีความหมาย", type: "depress" },
];

export const assessmentResult = [
    {
        title: "Depress",
        criteria: {
            normal: {
                definition:
                    "พลังใจของคุณยังอยู่ในเกณฑ์สมดุล สามารถจัดการกับความผิดหวังและมองเห็นสิ่งดีๆ ในชีวิตประจำวันได้ดี",
                suggestion:
                    "หมั่นเติมพลังใจให้ตนเองด้วยกิจกรรมที่ชอบนอกเวลางาน และชื่นชมความสำเร็จเล็กๆ ในแต่ละวันเพื่อรักษาความรู้สึกเชิงบวกนี้ไว้",
            },
            little: {
                definition:
                    "เริ่มมีอารมณ์ดิ่งหรือง่วงเหงาซึมเศร้าสะสมสูงกว่าปกติในบางช่วง พลังใจเริ่มลดลงเล็กน้อย",
                suggestion:
                    "ลองสังเกตว่าช่วงนี้มีเรื่องไหนที่ทำให้หมดพลังเป็นพิเศษไหมแนะนำให้แบ่งเวลาทำกิจกรรมผ่อนคลาย พักผ่อนให้เต็มที่ และพูดคุยระบายความรู้สึกกับเพื่อร่วมงานหรือคนที่ไว้วางใจ",
            },
            moderate: {
                difinition:
                    "สภาพอารมณ์ค่อนข้างหดหู่และมองโลกในแง่ลบชัดเจนขึ้นเริ่มขาดความกระตือรือร้นในการทำงานหรือชีวิตส่วนตัว",
                suggestion:
                    "สัญญาณรี้เตือนว่าใจคุณเริ่มล้า ลองมองหา เวลาส่วนตัว เพื่อถอยห่างจากเรื่องเครียดชั่วคราว หากเรื่มกระทบกับการทำงาน แนะนะให้ปรึกษานักจิตวิทยาหรือผู้เชี่ยวชาญเพื่อช่วยปรับมุมมองและเติมพลังใจ ",
            },
            severe: {
                difinition:
                    "ร่างกายและจิตใจกำลังส่งสัญญาณเตือนภัยขั้นวิกฤต คุณอาจร้สึกสิ้นหวัง เหนื่อยล้าอย่างรุนแรง หรือรู้สึกไร้ค่าจนกระทบต่อชีวิตและการทำงาน",
                suggestion:
                    "คุณไม่จำเป็นต้องแบกรับสิ่งนี่ไว้คนเดียว แนะนำให้หยุดพักผ่อนและเข้าพบจิตแพทย์หรือทีมนักจิตวิทยาของโรงพยาบาลโดยเร็ว เพื่อรับการประเมินและการดูแลที่ถูกต้อง ปลอดภัย และเป็นความรับขั้นสูงสุด",
            },
        },
    },
    {
        title: "Anxiety",
        criteria: {
            normal: {
                definition:
                    "ระบบประสาทและการตอบสนองต่อความกลัวอยู่ในเกณฑ์ปกติ ร่างกายไม่มีปฏิกิริยาตื่นตระหนกที่ควบคุมได้",
                suggestion:
                    "รักษาความสงบมั่นคงนี้ไว้ด้วยการฝึกสติ เผชิญหน้ากับความท้าทายในหน้าที่การงานอย่างรอบคอบและมีสติ",
            },
            little: {
                definition:
                    "เริ่มมีความกังวลใจจุกจิกบ่อยขึ้น อาจมีอาการทางกายเล็กน้อย เช่น ปากแห้ง มือกดเกร็ง หรือใจสั่นเวลามีเคสเร่งด่วน",
                suggestion:
                    "เมื่อรู้สึกเริ่มกังวล ลองหยุดพักนิ่งๆ สัก 1 นาที ฝึกหายใจเข้า-ออกลึกๆ (Deep Breathing) เพื่อปรับสมดุลระบบประสาทอัติโนมัติ และลดการดื่มคาเฟอีนระหว่างวันลง",
            },
            moderate: {
                difinition:
                    "ความวิตกกังวลสะสมค่อนข้างชัดเจน คุณอาจเริ่มกังวลล่วงหน้า กลัวความผิดพลาดในการทำงาน หรือกลัวหน้าแตก จนทำให้เริ่มสูญเสียความมั่นใจ",
                suggestion:
                    "สัญญาณนี้บอกว่าคุณกำลังระแวดระวังมากเกินไป ลองจัดระเบียบงาน เขียนลำดับขั้นตอนเพื่อลดความกังวล และฝึกเทคนิคการผ่อนคลายกล้ามเนื้อ หากความกังวลรบกวนสมาธิในการทำงาน ควรรีบปรึกษาผู้เชี่ยวชาญ",
            },
            severe: {
                difinition:
                    "อยู่ในสภาวะตื่นตระหนกสูง ระบบร่างกายตอบสนองต่อความกลัวรุนแรงเกินไป (เช่น ใจสั่นเหมือนจะเป็นลม หายใจไม่อิ่ม สั่นเทา หรือกลัวโดยไม่มีสาเหตุชัดเจน",
                suggestion:
                    "นี่เป็นภาวะที่ทรมาณและต้องการการช่วยเหลือทางการแพทย์ หากมีอาการกำเริบระหว่างเวร ให้แจ้งเพื่อนร่วมงานเพื่อสลับหน้าที่ชั่วคราวและแนะนำให้เข้าพบจิตแพทย์ทันทีเพื่อรับการรักษา ซึ่งจะช่วยให้ระบบประสาทของคุณกลับมาสงบได้อีกครั้ง",
            },
        },
    },
    {
        title: "Stress",
        criteria: {
            normal: {
                definition: "คุณบริหารจัดการความกดดันและภาระงานได้ดี ร่างกายและสมองสามารถผ่อนคลายจากความตึงเครียดได้ตามปกติ",
                suggestion:
                    "รักษาความสมดุลระหว่างชีวิตและการทำงาน (Work-Life Balance) ต่อไป และหมั่นทำกิจกรรมผ่อนคลายหลังลงเวรเป็นประจำ",
            },
            little: {
                definition: "เริ่มมีความตึงเครียดสะสมในระบบประสาท อาจรู้สึกไวต่อสิ่งกระตุ้นรอบข้าง หรือหงุดหงิดกับเรื่องเล็กๆ น้อยๆ ง่ายกว่าปกติ",
                suggestion:
                    "ลองมองหาเวลาพักสั้นๆ (Micro-breaks) ระหว่างวัน เช่น ออกไปดื่มน้ำ ยืดเส้นยืดสาย ฟังเพลงสั้นๆ หรือล้างหน้าให้สดชื่น เพื่อลดความตึงเตรียดสะสมของสมอง",
            },
            moderate: {
                difinition: "ความเครียดอยู่ในระดับสูง สมองและร่างกายตื่นตัวตลอดเวลา (Hyper-arousal) ทำให้อ่อนไหวง่าย สะเทือนใจง่าย และทนต่อสิ่งขัดใจหรือภาระงานที่ถาโถมได้น้อยลง",
                suggestion:
                    "สัญญาณนี้เตือนว่าคุณเสี่ยงต่อภาวะหมดไฟ (Burnout) ควรทบทวนการจัดลำดับความสำคัญของงาน (Prioritization) ปฎิเสธงานที่เกินกำลังหากทำได้ และใช้เวลาหลังเลิกงานในการ ตัดขาดจากเรื่องงาน อย่างจริงจังเพื่อฟื้นฟูร่างกาย",
            },
            severe: {
                difinition: "คุณกำลังเผชิญความเครียดในระดับวิกฤต พลังงานในร่างกายถูกใช้ไปจนหมด ไม่สามารถผ่อนคลายได้เลย และอาจมีการตอบโต้อารมณ์ที่รุนแรงเกินไป ซึ่งเสี่ยงต่อสุขภาพของคุณและความปลอดภัยในการทำงาน",
                suggestion:
                    "สมองและร่างกายของคุณต้องการการ Reset ด่วน ควรพูดคุยกับหัวหน้างานเพื่อขอปรับลดภาระงานหรือขอวันลาพักผ่อน และควรเข้าพบผู้เชี่ยวชาญด้านสุขภาพจิตเพื่อรับเครื่องมือและคำแนะนำในการจัดการความเครียดระดับสูงนี้อย่างปลอดภัย",
            },
        },
    },
];


